In [2]:
import pandas as pd

# Pandas series

In [2]:
ser=pd.Series([22,34,76],["Deepak","Amit","Rashmi"])
ser

Deepak    22
Amit      34
Rashmi    76
dtype: int64

In [3]:
ser.index

Index(['Deepak', 'Amit', 'Rashmi'], dtype='object')

In [5]:
ser.loc[['Deepak','Amit']]

Deepak    22
Amit      34
dtype: int64

## Series is 1D labelled array

In [6]:
ser.loc['Deepak']

22

In [13]:
ser[[2]]

Rashmi    76
dtype: int64

In [15]:
ser.iloc[0]

22

In [16]:
for i in (0:3):
    ser[[i]]

SyntaxError: invalid syntax (<ipython-input-16-0a7c695852a5>, line 1)

In [17]:
"Deepak" in ser

True

In [18]:
22 in ser

False

In [19]:
ser*2

Deepak     44
Amit       68
Rashmi    152
dtype: int64

In [20]:
ser**2

Deepak     484
Amit      1156
Rashmi    5776
dtype: int64

In [21]:
ser[['Amit','Deepak']]**2

Amit      1156
Deepak     484
dtype: int64

# pandas DataFrame
Creating DataFrame from dictionary of Python series

In [22]:
d={'Age':pd.Series([22,23,45],index=['D','A','C']),
   'Salary':pd.Series([1000,2000,3000],index=['D','A','C'])}

In [33]:
df=pd.DataFrame(d)
df

   Age  Salary
D   22    1000
A   23    2000
C   45    3000

In [30]:
df.index

Index(['D', 'A', 'C'], dtype='object')

In [31]:
df.columns

Index(['Age', 'Salary'], dtype='object')

In [32]:
pd.DataFrame(d,index=['D','A'])

   Age  Salary
D   22    1000
A   23    2000

In [34]:
pd.DataFrame(d,index=['D','A','C'],columns=['Age'])

   Age
D   22
A   23
C   45

In [36]:
data=[{'Deepak':1,'Ashish':2},{'Kavita':5,'Anmole':10,"Sanyam":20,"Deepak":20}]
pd.DataFrame(data)

   Anmole  Ashish  Deepak  Kavita  Sanyam
0     NaN     2.0       1     NaN     NaN
1    10.0     NaN      20     5.0    20.0

In [38]:
pd.DataFrame(data,index=["Section 1","Section 2"])

           Anmole  Ashish  Deepak  Kavita  Sanyam
Section 1     NaN     2.0       1     NaN     NaN
Section 2    10.0     NaN      20     5.0    20.0

In [39]:
pd.DataFrame(data,columns=["Anmole","Sanyam"])

   Anmole  Sanyam
0     NaN     NaN
1    10.0    20.0

# Basic DataFrame Operations

In [40]:
df

   Age  Salary
D   22    1000
A   23    2000
C   45    3000

In [41]:
df["Age"]

D    22
A    23
C    45
Name: Age, dtype: int64

In [52]:
df["Higher Salary"]=df["Salary"]>1000
df

   Salary  Higher Salary
D    1000          False
A    2000           True
C    3000           True

In [44]:
Age=df.pop("Age")

In [45]:
Age

D    22
A    23
C    45
Name: Age, dtype: int64

In [49]:
df

   Salary  Higher Salary
D    1000          False
A    2000           True
C    3000           True

In [53]:
del df["Higher Salary"]

In [54]:
df

   Salary
D    1000
A    2000
C    3000

In [55]:
df.insert(0,'Copy of Salary',df['Salary'])

In [56]:
df

   Copy of Salary  Salary
D            1000    1000
A            2000    2000
C            3000    3000

In [62]:
df.insert(1,'Copy of Salary 3',df['Salary'])

Can duplicate values but col name should be unique

In [60]:
df

   Copy of Salary  Copy of Salary 2  Salary
D            1000              1000    1000
A            2000              2000    2000
C            3000              3000    3000

# Case Study: Movie Data Analysis

In [87]:
movies=pd.read_csv("movies.csv",sep=',')

In [67]:
print(type(movies))

<class 'pandas.core.frame.DataFrame'>

In [66]:
movies.head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
10,11,"American President, The (1995)",Comedy|Drama|Romance
11,12,Dracula: Dead and Loving It (1995),Comedy|Horror
12,13,Balto (1995),Adventure|Animation|Children
13,14,Nixon (1995),Drama
14,15,Cutthroat Island (1995),Action|Adventure|Romance

In [68]:
movies.tail(10)

,movieId,title,genres
9732,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi
9733,193567,anohana: The Flower We Saw That Day - The Movi...,Animation|Drama
9734,193571,Silver Spoon (2014),Comedy|Drama
9735,193573,Love Live! The School Idol Movie (2015),Animation
9736,193579,Jon Stewart Has Left the Building (2015),Documentary
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

# Day 3 Coding

In [13]:

tags=pd.read_csv("tags.csv",sep=",")
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [12]:
ratings=pd.read_csv("ratings.csv",sep=",",parse_dates=['timestamp'])
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [14]:
del ratings["timestamp"]
del tags["timestamp"]

In [15]:
tags.head()

   userId  movieId              tag
0       2    60756            funny
1       2    60756  Highly quotable
2       2    60756     will ferrell
3       2    89774     Boxing story
4       2    89774              MMA

In [16]:
ratings.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [17]:
#Extract 0th row: notice that it is infact a Series

row_0 = tags.iloc[0]
type(row_0)

pandas.core.series.Series

In [20]:
row_0

userId         2
movieId    60756
tag        funny
Name: 0, dtype: object

In [21]:
row_0.index

Index(['userId', 'movieId', 'tag'], dtype='object')

In [22]:
row_0['userId']

2

In [23]:
row_0['movieId']

60756

In [24]:
'rating' in row_0

False

In [28]:
for x in row_0:
    print (x)

2
60756
funny

In [29]:
row_0.name

0

In [30]:
row_0 = row_0.rename('first_row')
row_0.name

'first_row'

In [34]:
range(0,tags.size)

range(0, 11049)

In [64]:
s=tags.size-1
s
for i in range(0,10,1):
    row=tags.iloc[i]

In [55]:
row

userId                7
movieId           48516
tag        way too long
Name: 9, dtype: object

# DataFrames

In [56]:
tags.head()

   userId  movieId              tag
0       2    60756            funny
1       2    60756  Highly quotable
2       2    60756     will ferrell
3       2    89774     Boxing story
4       2    89774              MMA

In [57]:
tags.index

RangeIndex(start=0, stop=3683, step=1)

In [58]:
tags.columns

Index(['userId', 'movieId', 'tag'], dtype='object')

In [59]:
# Extract row 0, 11, 2000 from DataFrame

tags.iloc[ [0,11,2000] ]

      userId  movieId       tag
0          2    60756     funny
11        18      431  gangster
2000     474     5450     women

In [71]:
rows=tags.iloc[range(0,10,1)]
rows

   userId  movieId              tag
0       2    60756            funny
2       2    60756     will ferrell
4       2    89774              MMA
6       2   106782            drugs
8       2   106782  Martin Scorsese

# Descriptive statistics

In [72]:
ratings['rating'].describe() #Only Rating wil be reflected

count    100836.000000
mean          3.501557
std           1.042529
min           0.500000
25%           3.000000
50%           3.500000
75%           4.000000
max           5.000000
Name: rating, dtype: float64

In [73]:
ratings.describe()

              userId        movieId         rating
count  100836.000000  100836.000000  100836.000000
mean      326.127564   19435.295718       3.501557
std       182.618491   35530.987199       1.042529
min         1.000000       1.000000       0.500000
25%       177.000000    1199.000000       3.000000
50%       325.000000    2991.000000       3.500000
75%       477.000000    8122.000000       4.000000
max       610.000000  193609.000000       5.000000

In [74]:
ratings['rating'].mean()

3.501556983616962

In [75]:
ratings.mean()

userId       326.127564
movieId    19435.295718
rating         3.501557
dtype: float64

In [76]:
ratings['rating'].min()

0.5

In [77]:
ratings['rating'].max()

5.0

In [78]:
ratings['rating'].std()

1.0425292390605359

In [79]:
ratings['rating'].mode()

0    4.0
dtype: float64

In [80]:
ratings.corr()

           userId   movieId    rating
userId   1.000000  0.006773 -0.049348
movieId  0.006773  1.000000 -0.004061
rating  -0.049348 -0.004061  1.000000

In [81]:
filter_1 = ratings['rating'] > 5
print(filter_1)
filter_1.any()

0         False
1         False
2         False
3         False
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26        False
27        False
28        False
29        False
          ...
100806    False
100807    False
100808    False
100809    False
100810    False
100811    False
100812    False
100813    False
100814    False
100815    False
100816    False
100817    False
100818    False
100819    False
100820    False
100821    False
100822    False
100823    False
100824    False
100825    False
100826    False
100827    False
100828    False
100829    False
100830    False
100831    False
100832    False
100833    False
100834    False
100835    False
Name: rating, Length: 100836, dtype: bool

False

In [82]:
filter_2 = ratings['rating'] > 0
print(filter_2)
filter_2.all()

0         True
1         True
2         True
3         True
4         True
5         True
6         True
7         True
8         True
9         True
10        True
11        True
12        True
13        True
14        True
15        True
16        True
17        True
18        True
19        True
20        True
21        True
22        True
23        True
24        True
25        True
26        True
27        True
28        True
29        True
          ...
100806    True
100807    True
100808    True
100809    True
100810    True
100811    True
100812    True
100813    True
100814    True
100815    True
100816    True
100817    True
100818    True
100819    True
100820    True
100821    True
100822    True
100823    True
100824    True
100825    True
100826    True
100827    True
100828    True
100829    True
100830    True
100831    True
100832    True
100833    True
100834    True
100835    True
Name: rating, Length: 100836, dtype: bool

True

In [85]:
type(filter_1)

pandas.core.series.Series

In [92]:
print (all([False, True, False, False])) # if any 1 is false, all() returns false

False

In [ ]:
print (any([False, True, False, False])) # if any 1 is true, any() returns true

# Data Cleaning

In [88]:
movies.shape

(9742, 3)

In [93]:
#is any row NULL ?

movies.isnull().any()

movieId    False
title      False
genres     False
dtype: bool

In [94]:
tags.isnull().any()

userId     False
movieId    False
tag        False
dtype: bool

In [95]:
ratings.isnull().any()

userId     False
movieId    False
rating     False
dtype: bool